GT3/setup_TM/RANS-koSSTv2/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
600
(
1.9143863
1.9143863
1.9143863
1.9143863
1.9143863
1.9143863
1.9143863
1.9143863
...
)
;
    }
    lowerSymmetry
    {
        type            calculated;
        value           uniform 0;
    }
    upperSymmetry
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
